OF_Sims/planar_Sims/100_cell_6dT/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          200;
        startFace       199;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       399;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       599;
    }
    centreline
    {
        type            patch;
        nFaces          1;
        startFace       600;
    }
    frontAndBack
    {
        type            patch;
        nFaces          400;
        startFace       601;
    }
)

// ************************************************************************* //
